Repository: 84000/data-translation-memory
Catalog: toh503_84000-the-detailed-account-of-the-previous-aspirations-of-the-seven-thus-gone-ones.tmx
Source language: bo
Languages: en

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་ཆེན་པོ་བརྒྱད་བཏབ་བོ། །བརྒྱད་གང་ཞེ་ན།
en: “Mañjuśrī, long ago, when that thus-gone, worthy, and perfect buddha was practicing bodhisattva conduct, he made the following eight great aspirations:

source: དེའི་སྨོན་ལམ་ཆེན་པོ་དང་པོ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་ཞིང་བླས་ཀྱི་ལས་ཀྱི་མཐའ་དང་ཚོང་ལ་དགའ་སྟེ། གཡེང་བ་སྣ་ཚོགས་མང་བས་དགེ་བའི་ཆོས་རྣམས་ལས་ཡོངས་སུ་ཉམས་པ་དང་། བྱང་ཆུབ་ཀྱི་སེམས་ཡིད་ལ་བྱེད་པ་ལས་ཡོངས་སུ་ཉམས་ཏེ། དེ་དག་འཁོར་བའི་སྡུག་བསྔལ་རྣམས་ལས་ཡོངས་སུ་ཐར་བར་མ་གྱུར་ཅིག །སོ་སོར་འཁོར་བའི་སྡུག་བསྔལ་རྣམས་མྱོང་བ་དང་། རྒ་བ་དང་། ན་བ་དང་། འཆི་བ་དང་། མྱ་ངན་དང་། སྨྲེ་སྔགས་འདོན་པ་དང་། སྡུག་བསྔལ་བ་དང་། ཡིད་མི་བདེ་བ་དང་། འཁྲུག་པ་རྣམས་མྱོང་བ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་།
en: “For his first great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, when beings bear in mind and mentally recite my name, may my power cause any who delight in agricultural work and commerce, who deviate from virtuous qualities due to their many distractions, who lose their focus on the mind of awakening, who do not attain freedom from the sufferings of cyclic existence, and who each experience their own particular saṃsāric sufferings—growing old, getting sick, dying, experiencing mental anguish, wailing, suffering, and being unhappy and disturbed—to obtain an abundance of clothing, food, drink, wealth, property, money, grain, riches, and gold, as soon as they wish for as long as it takes them to become perfect buddhas who have manifested unsurpassed and perfect awakening.

source: བདག་གི་མིང་ཡིད་ཀྱིས་བརྗོད་པས་དེ་དག་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་བསམས་མ་ཐག་ཏུ་བགོ་བ་དང་། བཟའ་བ་དང་། བཏུང་བ་དང་། ལོངས་སྤྱོད་དང་། ཡོངས་སུ་སྤྱད་པ་དང་། ནོར་དང་། འབྲུ་དང་། དབྱིག་དང་། གསེར་རྣམས་འབྱུང་བར་གྱུར་ཅིག །དགེ་བའི་ཆོས་རྣམས་ཀྱིས་རྣམ་པར་འཕེལ་བར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་སེམས་ཡིད་ལ་བྱེད་པ་དང་མི་འབྲལ་བར་གྱུར་ཅིག །ངན་སོང་གསུམ་དང་། སེམས་ཅན་དམྱལ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: May these virtuous qualities allow them to prosper. May their thoughts never stray from the mind of awakening. May they be liberated from all the suffering of the three lower rebirths and the hell realms.’

source: །བཅོམ་ལྡན་འདས་དེའི་སྨོན་ལམ་ཆེན་པོ་གཉིས་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་ན་སྒོ་ང་ལས་སྐྱེས་པའམ། མངལ་ལས་སྐྱེས་པའམ། དྲོད་གཤེར་ལས་སྐྱེས་པའམ། རྫུས་ཏེ་སྐྱེས་པའི་སེམས་ཅན་གང་དག་གྲང་བ་དང་། ཚ་བ་དང་། བཀྲེས་པ་དང་། སྐོམ་པས་ལུས་ཡོངས་སུ་གདུངས་ཤིང་སྡུག་བསྔལ་གྱི་ཚོར་བས་ཉམ་ཐག་པ་དེ་དག་བདག་གི་མཐུས།
en: “For that blessed one’s second great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings in this great trichiliocosm that are born from an egg, born from a womb, born from heat and moisture, or miraculously born, whose bodies are tormented by cold, heat, hunger, and thirst and afflicted by pain, to hear my name.

source: བདག་གི་མིང་རྣ་ལམ་དུ་གྲག་ཅིང་དེ་དག་གིས་བདག་གི་མིང་དྲན་པ་དང་། བརྗོད་པས་སྔོན་གྱི་ལས་ཀྱི་སྒྲིབ་པ་དེ་ཡོངས་སུ་བྱང་བར་གྱུར་ཅིག །སྐྱེ་བ་དེ་ཡང་ཐ་མ་པར་གྱུར་ཅིག །བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་སྐྱེ་བའི་སྡུག་བསྔལ་ཐམས་ཅད་ལས་ཡོངས་སུ་ཐར་བར་གྱུར་ཅིག །ལྷའི་ཡུལ་བའི་ལྷའི་བདེ་བ་མྱོང་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: When they recollect and recite my name, may they purify the karmic obscurations from their previous lives. May that be their final rebirth. May they be free from all manner of painful rebirth for as long as it takes to become perfect buddhas who have manifested unsurpassed and perfect awakening. May they experience the joy of a god in the god realms.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གསུམ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སྟོང་གསུམ་གྱི་སྟོང་ཆེན་པོའི་འཇིག་རྟེན་གྱི་ཁམས་འདི་ན་བུད་མེད་གང་དག་ཀུན་ནས་ཉོན་མོངས་པ་སྣ་ཚོགས་ཀྱིས་ལུས་ཡོངས་སུ་གང་ཞིང་བུད་མེད་ཀྱི་སྐྱེ་གནས་ལ་སྨོད་པ་དང་། གང་དག་བཙའ་བའི་དུས་ན་སྡུག་བསྔལ་གྱི་ཚོར་བ་མྱོང་བ་དེ་དག་བདག་གི་མཐུས།
en: “For his third great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any women in this great trichiliocosm whose bodies are full of all sorts of miserable afflictions, who dislike the condition of being a woman, and who suffer pain when they give birth, to hear my name.

source: བདག་གི་མིང་རྣ་ལམ་དུ་གྲག་ཅིང་དེ་དག་གིས་བདག་གི་མིང་དྲན་པ་དང་། བརྗོད་པས་ཚོར་བ་ཐམས་ཅད་དང་། སྡུག་བསྔལ་ཐམས་ཅད་རྒྱུན་ཆད་པར་གྱུར་ཅིག །སྐྱེ་བ་དེ་ཡང་ཐ་མ་པར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་སྐྱེས་པ་ཉིད་ཐོབ་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: When they recollect and recite my name, may they bring an end to all these agonies and all their suffering. May that be their final rebirth. May they be reborn as men for as long as it takes them to attain awakening.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་བཞི་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན།
en: “For his fourth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who are threatened by death, enemies, and the wilderness;

source: སེམས་ཅན་གང་དག་འཆི་བའམ། དགྲ་དང་། དགོན་པས་གཙེས་པ་དང་། ཕན་ཚུན་དུ་ཕ་མ་དང་། སྲིང་མོ་དང་། མཛའ་བཤེས་དང་། ཉེ་དུའི་མྱ་ངན་མྱོང་ཞིང་སྡུག་བསྔལ་དང་། མྱ་ངན་གྱི་ཟུག་རྔུས་ལུས་ལ་ཟུག་པ་དེ་དག་བདག་གི་མཐུས།
en: whose parents, sisters, friends, and kin each also experience mental anguish;

source: བདག་གི་མིང་རྣ་ལམ་དུ་གྲག་ཅིང་དེ་དག་གི་རྣ་ལམ་དུ་བདག་གི་མིང་གྲག་པ་དང་། ཁ་ཏོན་དུ་བཏོན་པས་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་འཆི་བ་དང་། དགྲ་དང་། དགོན་པའི་གནོད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་གྱུར་ཅིག །མྱ་ངན་དང་། སྡུག་བསྔལ་དང་བྲལ་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: and whose bodies are pierced by the thorn of suffering and mental anguish, to hear my name. When they hear and recite my name, may all threats related to death, enemies, and the wilderness be pacified, and may they be free from mental anguish and suffering for as long as it takes them to attain awakening.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་ལྔ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་མཚན་མོ་མུན་པ་མུན་ནག་ན་རྣམ་པར་རྒྱུ་བ་ལས་ཀྱི་མཐའ་རྣམ་པ་སྣ་ཚོགས་ལ་ཞུགས་པ། སྡིག་པ་ཅན་གྱི་གདོན་སྣ་ཚོགས་ཀྱིས་གཙེས་པ། འཇིགས་པས་སྨྲེ་སྔགས་སྣ་ཚོགས་འདོན་པ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་།
en: “For his fifth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who wander in the thick darkness of night engaged in various tasks who are tormented by various types of evil spirits and who cry out in fear, to no longer experience any such darkness for as long as it takes them to attain awakening when they bear my name in mind and mentally recite my name.

source: བདག་གི་མིང་ཡིད་ཀྱིས་བརྗོད་པས་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་མུན་པ་མུན་ནག་ཐམས་ཅད་མེད་པར་གྱུར་ཅིག །སྡིག་པ་ཅན་གྱི་གདོན་ཐམས་ཅད་བྱམས་པ་ལ་གནས་པར་གྱུར་ཅིག །མཆོད་པ་དང་། རིམ་གྲོ་བྱ་བ་རྣམ་པ་སྣ་ཚོགས་ལ་མངོན་པར་བརྩོན་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: May all the evil spirits become benevolent, and may they redirect their efforts toward various forms of worship and service.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་དྲུག་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་དམན་པ་ལ་མོས་ཤིང་ཤེས་རབ་ཆུང་ལ་དྲན་པ་རྨོངས་ཏེ། དགེ་བའི་ཆོས་རྣམས་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་དང་། སངས་རྒྱས་དང་། ཆོས་དང་། དགེ་འདུན་རྗེས་སུ་དྲན་པ་ལས་ཡོངས་སུ་ཉམས་པ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་།
en: “For his sixth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may my power cause any beings who have inferior aspirations and who are of little intelligence, have dull memories, and have lost all recollection of the virtuous qualities, powers, aspects of awakening, absorptions, and methods of retention, as well as of the Buddha, Dharma, and Saṅgha, to actualize the absorptions, mindfulnesses, powers, aspects of awakening, and methods of retention for as long as it takes them to attain awakening when they bear my name in mind and mentally recite my name.

source: བདག་གི་མིང་ཡིད་ཀྱིས་བརྗོད་པས་དེ་དག་བྱང་ཆུབ་ཀྱི་མཐར་ཐུག་གི་བར་དུ་ཏིང་ངེ་འཛིན་དང་། དྲན་པ་དང་། སྟོབས་དང་། བྱང་ཆུབ་ཀྱི་ཡན་ལག་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་མངོན་དུ་གྱུར་ཅིག །ཤེས་རབ་ཆེན་པོ་རྗེས་སུ་རྒྱུ་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: May they pursue great insight.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་བདུན་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན། བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་དམན་པ་ལ་མོས་ཤིང་ཉན་ཐོས་ཀྱི་ཐེག་པ་དང་། རང་སངས་རྒྱས་ཀྱི་ཐེག་པ་ལ་འདོད་པ་བསྐྱེད་དེ། དེ་ལ་གནས་ཤིང་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པར་གྱུར་པ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་།
en: “For his seventh great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, when beings bear my name in mind and mentally recite my name, may my power cause any who have inferior aspirations, who develop interest in the vehicle of hearers and solitary buddhas and remain in one of those vehicles, and who thus turn their backs on unsurpassed and perfect awakening, to not regress on the path to unsurpassed and perfect awakening for as long as it takes them to become perfect buddhas who have manifested unsurpassed and perfect awakening.

source: བདག་གི་མིང་ཡིད་ཀྱིས་བརྗོད་པས་དེ་དག་ཐམས་ཅད་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་ལས་ཕྱིར་མི་ལྡོག་པར་གྱུར་ཅིག །ཉན་ཐོས་དང་། རང་སངས་རྒྱས་ཀྱིས་ལ་རྒྱབ་ཀྱིས་ཕྱོགས་པར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་སེམས་ཡིད་ལ་བྱེད་པ་དང་མི་འབྲལ་བར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: May they turn their backs on the vehicles of the hearers and solitary buddhas, and may their thoughts never stray from the mind of awakening.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་བརྒྱད་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་བསྐལ་པ་ཆེན་པོ་ཟད་པའི་ཚེ་འཛམ་བུའི་གླིང་ཀུན་ཏུ་འབར་ཞིང་རབ་ཏུ་འབར་བར་འཁྲུགས་པར་འགྱུར་ཏེ་ངུ་ཞིང་མྱ་ངན་བྱེད་ལ་སྔོན་གྱི་མི་དགེ་བའི་ལས་ཀྱི་རྒྱུས་སྡུག་བསྔལ་མྱོང་ཞིང་སྐྱབས་མེད་མགོན་མེད་པའི་སེམས་ཅན་དེ་དག་བདག་གི་མཐུས།
en: “For his eighth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, when Jambudvīpa is set ablaze at the dissolution of the great eon and is engulfed in ravenous flames, may my power cause any beings who weep, experience mental anguish, and experience the suffering caused by their previous nonvirtuous actions, and who have no refuge or protector, to be free from all suffering and mental anguish.

source: བདག་གི་མིང་ཡིད་ལ་གནས་ཤིང་། བདག་གི་མིང་ཡིད་ཀྱིས་བརྗོད་པས་དེ་དག་སྡུག་བསྔལ་དང་། མྱ་ངན་ཐམས་ཅད་དང་བྲལ་བར་གྱུར་ཅིག །བསིལ་བའི་དངོས་པོ་ཐོབ་པར་གྱུར་ཅིག །དེ་ནས་ཤི་འཕོས་ནས་བདག་གི་སངས་རྒྱས་ཀྱི་ཞིང་དུ་པདྨའི་སྙིང་པོའི་སེང་གེའི་ཁྲི་ལ་རྫུས་ཏེ་སྐྱེ་བར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ།
en: May they be cooled, and when they pass away, may they take miraculous rebirth in my buddhafield upon a lion throne in the center of a lotus by bearing my name in mind and mentally reciting my name.’

source: འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་ཆེན་པོ་བརྒྱད་པོ་དེ་དག་བཏབ་བོ།
en: “Mañjuśrī, those are the eight great aspirations that the Blessed One made long ago, when he was practicing bodhisattva conduct.

source: །འཇམ་དཔལ་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་རིན་པོ་ཆེ་དང་ཟླ་བ་དང་པདྨས་རབ་ཏུ་བརྒྱན་པ་མཁས་པ་གཟི་བརྗིད་ཀྱི་སྒྲ་དབྱངས་ཀྱི་རྒྱལ་པོ་དེའི་སངས་རྒྱས་ཀྱི་ཞིང་དེ་ནི་མཉམ་པ། ཐ་གྲུ་ཆེ་བ། ཡངས་པ། ལག་མཐིལ་ལྟར་མཉམ་པར་གྱུར་པ།
en: Mañjuśrī, the buddhafield of the thus-gone, worthy, and perfect Buddha Kuśala­tejonir­ghoṣa­rāja, who is adorned with a precious jewel, a moon, and a lotus, is even, wide, spacious, and flat like the palm of a hand.

source: ལྷའི་སྤོས་ཀྱི་ཤིང་ལྗོན་པ་རྣམས་ཀྱིས་རབ་ཏུ་བརྒྱན་པ།
en: It is ornamented with divinely scented trees.

source: སྤོས་གཙང་ཞིང་སྐྱོན་མེད་པ་དང་། ལྷའི་སྤོས་དང་། མེ་ཏོག་གིས་རབ་ཏུ་བརྒྱན་པ།
en: It has a pure and flawless fragrance and is adorned with divinely scented flowers.

source: ལྷའི་རོལ་མོའི་སྒྲ་སྐད་དང་། གླུའི་ང་རོ་འབྱུང་བ།
en: The music of celestial instruments and melodious songs fills the air.

source: ལྷའི་རིན་པོ་ཆེའི་དྲིལ་བུ་གཡེར་ཀའི་དྲ་བས་ལེགས་པར་བརྒྱན་པ། ལྷའི་རིན་པོ་ཆེའི་སེང་གེའི་ཁྲིས་མཛེས་པར་བྱས་པ།
en: It is adorned with webs of tinkling bells made of divine jewels and decorated with a divine jeweled lion throne.

source: ལྷའི་རིན་པོ་ཆེའི་རྫིང་གིས་རབ་ཏུ་བརྒྱན་པ།
en: It is ornamented with divine jeweled pools.

source: ས་གཞི་འཇམ་ཞིང་སྙི་བ། རི་དང་། རྡོ་དང་། གསེག་མ་དང་། ཚེར་མ་མེད་པ།
en: The ground is soft and smooth, and there are no mountains, stones, pebbles, or thorns.

source: ཉེ་བའི་ཉོན་མོངས་པ་མེད་པ། ཕྱིར་མི་ལྡོག་པའི་བྱང་ཆུབ་སེམས་དཔའི་སར་གྱུར་པའོ།
en: There are no derivative afflictions, and everyone is at the level of a nonregressing bodhisattva.

source: །བྱང་ཆུབ་སེམས་དཔའ་དེ་དག་ཐམས་ཅད་ཀྱང་པདྨའི་སྙིང་པོའི་སེང་གེའི་ཁྲི་ལ་རྫུས་ཏེ་བྱུང་བ། ལྷའི་རིན་པོ་ཆེའི་རྒྱན་དང་གོས་ཀྱིས་ལུས་ལེགས་པར་བརྒྱན་པ་ཤ་སྟག་གོ།
en: All the bodhisattvas there are miraculously born on a lion throne in the center of a lotus, and their bodies are all perfectly adorned with divine jeweled clothing and ornaments.

source: །སངས་རྒྱས་ཀྱི་ཞིང་དེ་ན་བསམས་མ་ཐག་པ་ཙམ་གྱིས་གོས་དང་། ཟས་དང་། སྐོམ་དང་། མལ་ཆ་དང་། སྤོས་དང་། མེ་ཏོག་དང་། ཕྲེང་བ་དང་། རྒྱན་དང་། བྱང་ཆུབ་སེམས་དཔའི་ལོངས་སྤྱོད་ཐམས་ཅད་དང་། སེམས་ཅན་གྱི་འཚོག་ཆས་ཐམས་ཅད་དང་། ལྷའི་རིན་པོ་ཆེའི་ལོངས་སྤྱོད་ཐམས་ཅད་འབྱུང་སྟེ།
en: In that buddhafield, all clothing, food, drink, bedding, fragrances, flowers, and garlands, all the pleasures of a bodhisattva, all the necessities of a living being, and all the wealth consisting of divine jewels appear as soon as they think of them.

source: དེའི་ཕྱིར་འཇིག་རྟེན་གྱི་ཁམས་དེ་རིན་པོ་ཆེ་དང་ལྡན་པ་ཞེས་བྱའོ།
en: That is why that world is called Abounding in Jewels.

source: །འཇམ་དཔལ་དེ་ལྟ་བས་ན་དད་པའི་རིགས་ཀྱི་བུའམ། རིགས་ཀྱི་བུ་མོའམ། རྒྱལ་པོ་འམ། རྒྱལ་བུ་དག་གིས་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་རིན་པོ་ཆེ་དང་། ཟླ་བ་དང་། པདྨས་རབ་ཏུ་བརྒྱན་པ་མཁས་པ་གཟི་བརྗིད་སྒྲ་དབྱངས་ཀྱི་རྒྱལ་པོ་དེའི་མཚན་ཉིན་ལན་གསུམ། མཚན་ལན་གསུམ་དུ་ཡིད་ལ་བྱ།
en: “Mañjuśrī, that is why faithful sons and daughters of good family as well as kings and princes should focus on the name of the blessed Thus-Gone One Kuśala­tejonir­ghoṣa­rāja, who is adorned with a precious jewel, a moon, and a lotus, three times each day and three times each night.

source: རབ་ཏུ་གུས་པར་གཟུང་བར་བྱ། དད་པར་བྱ།
en: They should bear it in mind with the highest devotion and have faith in it.

source: དེ་བཞིན་གཤེགས་པ་དེའི་སྐུ་གཟུགས་ཀྱང་བྱེད་དུ་གཞུག །མེ་ཏོག་དང་། བདུག་པ་དང་། སྤོས་དང་། ཕྲེང་བ་དང་། བྱུག་པ་དང་། རོལ་མོའི་སྒྲ་དང་། མར་མེ་རྣམས་ཀྱིས་མཆོད་པར་བྱ།
en: They should commission a statue of that thus-gone one and make offerings to it with flowers, incense, perfumes, garlands, ointments, music, and oil lamps.

source: ཡན་ལག་བརྒྱད་པའི་བསྙེན་གནས་ལ་ཉེ་བར་གནས་ལ། ཉིན་བདུན་གཙང་མར་བྱས་ཏེ་ས་ཕྱོགས་གཙང་མར་གནས་པར་བྱ།
en: They should maintain the eightfold precepts and purify themselves for seven days.

source: སངས་རྒྱས་ཀྱི་ཞིང་དེར་སྐྱེ་བར་སྨོན་ལམ་གདབ་ཅིང་སེམས་ཅན་ཐམས་ཅད་ལ་བྱམས་པ་དང་། སྙིང་རྗེ་བའི་སེམས་སུ་བྱས་ན།
en: Then they should sit in a spot that has been purified, pronounce the aspiration to be born in that buddhafield, and generate an attitude of love and compassion toward all beings.

source: དེ་ལ་དེ་བཞིན་གཤེགས་པ་དེ་དགོངས་པར་འགྱུར་རོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་རྣམས་ཀྱང་སེམས་པར་འགྱུར་རོ།
en: “If they do this, the Thus-Gone One will turn their attention toward them and the bodhisattva great beings will think of them.

source: །སྡིག་པ་ཐམས་ཅད་དང་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱང་ཡོངས་སུ་བྱང་བར་འགྱུར་རོ།
en: All their misdeeds and all their karmic obscurations will be purified.

source: །བྱང་ཆུབ་ཀྱི་སེམས་ཡིད་ལ་བྱེད་པ་དང་མི་འབྲལ་བར་འགྱུར་རོ། །འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་སྲབས་པར་འགྱུར་རོ།
en: Their thoughts will never stray from the mind of awakening, and desire, hatred, and delusion will vanish.

source: །ཡུན་རིང་དུ་འཚོ་ཞིང་ནད་མེད་པར་འགྱུར་རོ།
en: They will have long lives and be free from illness.

source: །གང་བསམས་པའི་བསམ་པ་དེ་དག་ཐམས་ཅད་ཡོངས་སུ་རྫོགས་པར་འགྱུར་རོ། །འཐབ་པ་དང་། འཐབ་མོ་དང་། རྩོད་པ་དང་། འགྱེད་པ་ཐམས་ཅད་རབ་ཏུ་ཞི་བར་འགྱུར་རོ།
en: Anything upon which they set their intention will come to pass, and all fighting, quarreling, arguing, and disputes will cease.

source: །འདི་ནས་ཤི་འཕོས་ནས་སྡིག་པ་ཐམས་ཅད་ཟད་པར་འགྱུར་ཏེ། སངས་རྒྱས་ཀྱི་ཞིང་དེར་པདྨའི་སྙིང་པོའི་སེང་གེའི་ཁྲི་ལ་རྫུས་ཏེ་སྐྱེ་བར་འགྱུར་རོ།
en: When they pass away, all their misdeeds will have been eliminated, and they will take miraculous rebirth in that buddhafield upon a lion throne in the center of a lotus.

source: །སྐྱེས་མ་ཐག་ཏུ་ཏིང་ངེ་འཛིན་དང་། གཟུངས་ཀྱི་སྒོ་རྣམས་མངོན་དུ་འགྱུར་རོ།
en: As soon as they are born, they will manifest the absorptions and methods of retention.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དེའི་མཚན་འཛིན་པ་འདི་ནི་དེ་ལྟར་ཡོན་ཏན་མང་པོ་དང་ལྡན་པ་ཡིན་ནོ།
en: Mañjuśrī, such are the many good qualities that incur to one who retains the name of that blessed thus-gone one.

source: །འཇམ་དཔལ་ཤར་ཕྱོགས་ལོགས་སུ་སངས་རྒྱས་ཀྱི་ཞིང་གང་གཱའི་ཀླུང་ལྔའི་བྱེ་མ་སྙེད་འདས་པ་ན་འཇིག་རྟེན་གྱི་ཁམས་སྤོས་ཀྱིས་ཡོངས་སུ་གང་བ་རིན་ཆེན་བརྩེགས་པ་ན། དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་བཟངས་དྲི་མེད་རིན་ཆེན་སྣང་བརྟུལ་ཞུགས་གྲུབ་པ་ཞེས་བྱ་བ་བཞུགས་ཏེ།
en: “Mañjuśrī, to the east of this buddhafield, past as many buddhafields as there are grains of sand in five Gaṅgā rivers the thus-gone, worthy, and perfect Buddha Suvarṇa­bhadra­vimala­ratna­prabhā­savrata­siddhi lives in the world Heaped with Jewels and Full of Perfume.

source: འཚོ་ཞིང་གཞེས་ལ་ཆོས་ཀྱང་སྟོན་ཅིང་བྱང་ཆུབ་སེམས་དཔའ་བྱེ་བ་ཁྲག་ཁྲིག་བརྒྱ་སྟོང་དུ་མས་ཀུན་ནས་བསྐོར་བ་ཡོད་དོ།
en: There he lives, resides, and teaches the Dharma accompanied by billions of bodhisattva attendants.

source: །འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་ཆེན་པོ་བཞི་བཏབ་བོ། །བཞི་གང་ཞེ་ན།
en: “Mañjuśrī, long ago, when he was practicing bodhisattva conduct, that blessed, thus-gone, worthy, and perfect buddha proclaimed the following four great aspirations:

source: དེའི་སྨོན་ལམ་ཆེན་པོ་དང་པོ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་སྲོག་གཅོད་པ། སྲོག་གཅོད་པའི་མི་དགེ་བའི་ལས་རྣམ་པ་སྣ་ཚོགས་བྱེད་པ། སྲོག་ཆགས་རྣམ་པ་སྣ་ཚོགས་ཀྱི་སྲོག་གཅོད་པ་དེ་དག་སྲོག་གཅོད་པ་བྱས་པས་ཚེ་ཐུང་ཞིང་ནད་མང་བ་དང་། ཆུ་དང་། དུག་དང་། མཚོན་དང་། མེ་དང་། ནད་སྣ་ཚོགས་ཀྱིས་འཆི་བར་འགྱུར་བ་དེ་དག་གིས་བདག་གི་མིང་ཐོས་ནས་འཛིན་པ་དང་། མཆོད་པས་ལས་ཀྱི་སྒྲིབ་པ་དེ་ཡོངས་སུ་བྱང་སྟེ་ཚེ་རིང་བར་གྱུར་ཅིག །ནད་མེད་པར་གྱུར་ཅིག །སུ་ཡང་དུས་མ་ཡིན་པར་འཆི་བས་འཆི་བའི་དུས་བྱེད་པར་མ་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: “For his first great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who commit murder, who perform various nonvirtuous acts of killing, who kill various types of living beings, and who, because they have killed, will have short lifespans, many illnesses, and suffer untimely deaths by drowning, poison, weaponry, fire, and various diseases hear my name. By retaining it and making offerings, may they purify those karmic obscurations, may they have long lives and be free of illness, and may anyone who might have suffered an untimely death not suffer an untimely death.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གཉིས་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་སྡིག་པ་མི་དགེ་བ་སྣ་ཚོགས་བྱས་ཏེ། གཞན་གྱི་རྫས་ཕྲོགས་པས་དབུལ་པོའི་ཁྱིམ་དུ་སྐྱེས་ཏེ། སྒྲེན་མོ་དང་། བཀྲེས་པ་དང་། སྐོམ་པས་ལུས་ཡོངས་སུ་གདུངས་ཤིང་སྡུག་བསྔལ་མྱོང་བ་དེ་དག་གིས་བདག་གི་མིང་ཐོས་ནས་བཟུང་བས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་སྡིག་པ་ཐམས་ཅད་བྱང་བར་གྱུར་ཅིག །དབང་ཕྱུག་ཕུན་སུམ་ཚོགས་ཤིང་མ་ཚང་བ་མེད་པ་ཐོབ་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: “For his second great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who have committed various misdeeds and nonvirtuous actions, who have been born in poor households because they stole another person’s wealth , who are destitute, whose bodies are tormented by hunger and thirst, and who experience suffering hear my name.

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་གསུམ་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན།
en: By retaining it, may all their misdeeds be purified for as long as it takes them to become perfect buddhas who have manifested unsurpassed and perfect awakening.

source: སེམས་ཅན་གང་དག་གཅིག་ལ་གཅིག་ཀུན་དུ་གནོད་སེམས་དང་ལྡན་ཞིང་ཕན་ཚུན་སྲོག་གཅོད་པ་བྱེད་པ་དང་། འཐབ་པ་དེ་དག་གིས་བདག་གི་མིང་ཐོས་པས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ཕན་ཚུན་ཕ་མ་ལྟར་བྱམས་པ་ལ་གནས་པར་གྱུར་ཅིག་ཅེས་བཏབ་བོ།
en: May they be powerful and prosperous, and may they lack nothing.’ “For his third great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, may any beings who harbor thoughts of harming one another and who kill and fight one another hear my name and thereby come to love one another like parents love a child for as long as it takes them to become perfect buddhas who have manifested unsurpassed and perfect awakening.’

source: །དེའི་སྨོན་ལམ་ཆེན་པོ་བཞི་པ་ནི་གང་གི་ཚེ་བདག་མ་འོངས་པའི་དུས་ན་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་པ་དེ་ན། སེམས་ཅན་གང་དག་འདོད་ཆགས་དང་། ཞེ་སྡང་དང་། གཏི་མུག་གིས་བསྒྲིབས་ཏེ། ཚུལ་ཁྲིམས་འཆལ་བར་གྱུར་བ་དེ་དག་སྡིག་པ་ཀུན་ཏུ་སྤྱོད་དེ། དེ་བཞིན་གཤེགས་པའི་བསླབ་པ་དྲལ་བས་ངན་སོང་གསུམ་དུ་ལྟུང་བ་དང་། སེམས་ཅན་དམྱལ་བར་འགྲོ་བར་འགྱུར་བ་དེ་དག་བདག་གི་མཐུས། བདག་གི་མིང་ཐོས་ནས་བླ་ན་མེད་པ་ཡང་དག་པར་རྫོགས་པའི་བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ཀྱི་བར་དུ་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཡོངས་སུ་བྱང་བར་གྱུར་ཅིག །ཉེ་བའི་ཉོན་མོངས་རྣམས་དང་བྲལ་བར་གྱུར་ཅིག །ཚུལ་ཁྲིམས་ཡང་དག་པར་འཛིན་ཅིང་།
en: “For his fourth great aspiration he proclaimed, ‘In the future, when I have become a perfect buddha who has realized unsurpassed and perfect awakening, after hearing my name, may my power cause any beings who are veiled by desire, hatred, and delusion—who have faulty ethics and commit misdeeds, violate the trainings of the thus-gone ones, fall into the three lower realms, and proceed to the hell realms—to have all their karmic obscurations purified for as long as it takes them to become perfect buddhas who have manifested unsurpassed and perfect awakening.

source: ལུས་དང་། ངག་དང་། ཡིད་སྡོམ་པ་ལ་གནས་པར་གྱུར་ཅིག །བྱང་ཆུབ་ཀྱི་སེམས་ཡིད་ལ་བྱེད་པ་དང་མི་འབྲལ་བར་གྱུར་ཅིག་ཅེས་བཏབ་སྟེ། འཇམ་དཔལ་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དགྲ་བཅོམ་པ་ཡང་དག་པར་རྫོགས་པའི་སངས་རྒྱས་གསེར་བཟངས་དྲི་མེད་རིན་ཆེན་སྣང་བརྟུལ་ཞུགས་གྲུབ་པ་དེ་སྔོན་བྱང་ཆུབ་སེམས་དཔའི་སྤྱད་པ་སྤྱོད་པ་ན་སྨོན་ལམ་ཆེན་པོ་བཞི་པོ་དེ་དག་བཏབ་བོ།
en: May they be free from the derivative afflictions, and may they maintain perfect discipline. May they maintain their vows in body, speech, and mind, and may their thoughts never stray from the mind of awakening.’ Those, Mañjuśrī, are the four aspirations that the blessed, thus-gone, worthy, and perfect Buddha Suvarṇa­bhadra­vimala­ratna­prabhā­savrata­siddhi proclaimed long ago, when he was practicing bodhisattva conduct.
